УправлениеСдачейКвартир/src/Documents/ЗаданияДляГоничной/ЗаданияДляГоничной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияДляГоничной</name>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаУборку</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Горничная</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УправлениеСдачейКвартир/src/InformationRegisters/КонтрольСдачиКвартир/КонтрольСдачиКвартир.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольСдачиКвартир</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сдача</name>
    <type>
      <types>DocumentRef.СдачаВАренду</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеСдачейКвартир/src/Enums/ВидДоговора/ВидДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДоговора</name>
  <enumValues>
    <name>САрендодателем</name>
  </enumValues>
  <enumValues>
    <name>САрендатором</name>
  </enumValues>
</mdclass:Enum>

УправлениеСдачейКвартир/src/Documents/ЗаданияДляГоничной/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Объект.ТелефонКлиента = ПолучитьТелефонКлиента(Объект.Квартира);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТелефонКлиента(Квартира)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрольСдачиКвартир.Договор.Владелец.Телефон КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтрольСдачиКвартир КАК КонтрольСдачиКвартир
		|ГДЕ
		|	КонтрольСдачиКвартир.Квартира = &Квартира
		|	И КонтрольСдачиКвартир.Договор.ВидДоговора = &ВидДоговора
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрольСдачиКвартир.ДатаОкончания УБЫВ";
	Запрос.УстановитьПараметр("Квартира", Квартира);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидДоговора.САрендатором);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Телефон;
	КонецЕсли;
	
	Возврат "";
КонецФункции

#КонецОбласти
